import React from 'react';
import s from './AboutMe.module.css';
import JuliaFedoruk from './../../img/JuliaFedoruk.jpg'

const AboutMe = () => {
    return (
        <section className={s.about_me_wrapper}>
            <div className={s.about_me}>
                <img src={JuliaFedoruk} alt="Julia_Fedoruk"/>
                <p className={s.about_me_text}>
                    Привіт! Як ви вже зрозуміли, мене звати Юлія Федорук, і мені дуже приємно, що ви потрапили на мій
                    сайт.
                    <br/><br/>
                    Напевно, весь свій час я кимось хотіла бути: в дитинстві мріяла стати ветеринаром. Періодично
                    пробивалось бажання спробувати себе в ролі художника, але так і не склалось.
                    <br/><br/>
                    У 2018 році я з моїм чоловіком зіткнулися з проблемою, що для всіх наших сукулентів та кактусів
                    не можемо знайти горщики, які були б нам до вподоби.
                    <br/><br/>
                    Гортаючи соцмережі, я побачила, як люди роблять горщики з бетону, різноманітні і дуже гарні. І тут я
                    задаю питання чоловіку:
                    <br/>
                    - Можливо, я зроблю горщики сама з бетону?!
                    <br/>
                    - Спробуй, а я тебе підтримаю, - відповів він.
                    <br/>
                    Ну і тут все закрутилось, завертілось.
                </p>
            </div>
        </section>
    );
}

export default AboutMe;
