import React from 'react';
import s from './AboutMe.module.css';
import JuliaFedoruk from './../../img/JuliaFedoruk.jpg'

const AboutMe = (props) => {
    //console.log(props.match)
    // debugger
    return (
        <section className=
         {props.location.pathname === '/' ? `${s.about_me}` : `${s.display_none}`}>
            <img src={JuliaFedoruk} alt="Julia_Fedoruk"/>
            <p className={s.about_me_text}>
                Привіт! Як ви вже зрозуміли, мене звати Юлія Федорук, і мені дуже приємно, що ви потрапили на мій
                сайт.
                <br/><br/>
                Напевно, весь свій час я кимось хотіла бути: в дитинстві мріяла стати ветеринаром. Періодично
                пробивалось бажання спробувати себе в ролі художника, але так і не склалось.
                <br/><br/>
                Я одружена з чоловіком, який в захваті від сукулентів та кактусів. Перші його кактуси були вирощені з
                насіння.
                Їх було рівно 50шт. З початку нашого сімейного життя в нас вже більше 300 коренів різних сукулентів та
                кактусів.
                Мені тепер не треба думати над подарунком для нього. Рідка хавортія чи ечеверія - і радості чоловіка
                немає меж.
                <br/><br/>
                У 2018 році я з моїм чоловіком зіткнулися з проблемою, що для всіх наших сукулентів та кактусів
                не можемо знайти горщики, які були б нам до вподоби.
                <br/><br/>
                Гортаючи соцмережі, я побачила як люди роблять горщики з бетону, різноманітні і дуже гарні.
                Мені сподобалось, і я задала логічне питання чоловіку:
                <br/>
                - Можливо, я зроблю горщики сама з бетону?!
                <br/>
                - Спробуй, а я тебе підтримаю, - відповів він.
                <br/>
                Ну і тут все закрутилось, завертілось.
                <br/><br/>
                Мене затягнуло, хоча, не все було так радісно, як зараз.
                <br/><br/>
                Перші мої горщики виходили гарні, але не якісні. Про це я дізналася, коли чоловік посадив в
                перший мій бетонний горщик ечеверію, а потім полив її. Як зараз пам’ятаю цей момент.
                Вечір, чоловік займається своїми сукулентами і кактусами: плановий підлив, підкормка, пересадка.
                І тут, в квартирі, роздається такий звук: «цокккк». Ми, напевно, хвилин двадцять не могли
                знайти причину того звуку. Вже все обійшли, обдивились, усюди позаглядали.
                Не знайшовши причини, подумали, що звук пролунав з вулиці.
                Але через пів години чоловік все ж таки знайшов причину звуку. Тріснув горщик.
                По всіх гранях! Я, звісно, була розчарована.
                <br/><br/>
                Виправити свою помилку змогла лише через місяць. Інформації в Інтернеті про декоративний бетон
                майже немає. На всіх сайтах тобі розкажуть все про бетон, але тільки будівельний.
                <br/><br/>
                До ідеального бетонного замісу я дійшла лише через пів року моїх старань, навчання та купи
                експериментів.
                Можу сказати Вам, що я пишаюся всім тим, чого досягла за цей період.
                <br/><br/>
                Що я пропоную?!
                <br/><br/>
                - Мінімалістичний дизайн у скандинавському стилі та стилі loft.
                <br/>
                - Нетипові подарунки для Ваших рідних та близьких.
            </p>
        </section>
    );
}

export default AboutMe;
